---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassLevelData.ConceptualConstructionId
source: html/88677e76-8bd6-0759-bcca-2564315f2f5b.htm
---
# Autodesk.Revit.DB.Analysis.MassLevelData.ConceptualConstructionId Property

The ElementId of the conceptual construction associated with the MassLevelData (Mass Floor).

## Syntax (C#)
```csharp
public ElementId ConceptualConstructionId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input ElementId conceptualConstructionId is not a valid conceptual construction type ElementId.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null